юв_гит_/src/DataProcessors/СозданиеДокументовРеализации/СозданиеДокументовРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеДокументовРеализации</name>
</mdclass:DataProcessor>

юв_гит_/src/AccumulationRegisters/ПроизводствоИзделий/ПроизводствоИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПроизводствоИзделий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводствоИзделия</name>
    <type>
      <types>DocumentRef.Производство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

юв_гит_/src/Enums/СостояниеЗаказов/СостояниеЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказов</name>
  <enumValues>
    <name>Заказан</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

юв_гит_/src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказанныеИзделия</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/DataProcessors/СозданиеДокументовРеализации/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
     НачальнаяДата 	= НачалоДня(ТекущаяДата());
	 КонечнаяДата 	= КонецДня(ТекущаяДата());
     ЗаполнитьПроизводствоЗаказовНаСервере();
КонецПроцедуры

Процедура ЗаполнитьПроизводствоЗаказовНаСервере()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачальнаяДата",НачальнаяДата);
	ПараметрыОтчета.Вставить("КонечнаяДата",КонечнаяДата);	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоИзделийОстаткиИОбороты.ЗаказКлиента КАК ЗаказКлиента,
		|	ПроизводствоИзделийОстаткиИОбороты.ЗаказКлиента.ЗаказанныеИзделия.(
		|		Изделие КАК Изделие,
		|		Спецификация КАК Спецификация,
		|		Количество КАК Заказано,
		|		Производство.Потребность КАК Произведено,
		|		Производство КАК ПроизводствоИзделия
		|	) КАК СоставЗаказа,
		|	ПроизводствоИзделийОстаткиИОбороты.КоличествоПриход КАК ИтогЗаказано,
		|	ПроизводствоИзделийОстаткиИОбороты.КоличествоРасход КАК ИтогПроизведено,
		|	ПроизводствоИзделийОстаткиИОбороты.КоличествоКонечныйОстаток КАК ИтогОсталосьИзготовить
		|ИЗ
		|	РегистрНакопления.ПроизводствоИзделий.ОстаткиИОбороты(&НачальнаяДата, &КонечнаяДата, , ,
		|   ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказов.Завершен))
		|   КАК ПроизводствоИзделийОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводствоИзделийОстаткиИОбороты.ЗаказКлиента.Дата";
	
	Запрос.УстановитьПараметр("НачальнаяДата", НачальнаяДата);
    Запрос.УстановитьПараметр("КонечнаяДата", КонечнаяДата);
	
	РезультатЗапроса	 = Запрос.Выполнить();	
	ЗаказыКлиентов 		 = РезультатЗапроса.Выбрать();
	
	Пока ЗаказыКлиентов.Следующий() Цикл
       ЭлементыДерева 		   = ПроизводствоЗаказов.ПолучитьЭлементы();
	   ВеткаЗаказ			   = ЭлементыДерева.Добавить();
	   ВеткаЗаказ.ЗаказКлиента = ЗаказыКлиентов.ЗаказКлиента;
		
	   тз_СоставЗаказа = ЗаказыКлиентов.СоставЗаказа.Выгрузить();
	   Для каждого СтрСоставЗаказа Из тз_СоставЗаказа Цикл
	       ЭлементыЗаказа 					= ВеткаЗаказ.ПолучитьЭлементы();
		   ЭлементЗаказа 					= ЭлементыЗаказа.Добавить();
		   ЭлементЗаказа.ЗаказКлиента       = СтрСоставЗаказа.Изделие;
		   ЭлементЗаказа.Спецификация       = СтрСоставЗаказа.Спецификация;
		   ЭлементЗаказа.Заказано           = СтрСоставЗаказа.Заказано;
		   ЭлементЗаказа.Произведено        = СтрСоставЗаказа.Произведено;
		   ЭлементЗаказа.ПроизводствоИзделия  = СтрСоставЗаказа.ПроизводствоИзделия;
		   ЭлементЗаказа.ОсталосьИзготовить = ЭлементЗаказа.Заказано - ЭлементЗаказа.Произведено;
	   КонецЦикла;
	   
	   ВеткаЗаказ.Заказано 			 = ЗаказыКлиентов.ИтогЗаказано;
	   ВеткаЗаказ.Произведено 		 = ЗаказыКлиентов.ИтогПроизведено;
	   ВеткаЗаказ.ОсталосьИзготовить = ЗаказыКлиентов.ИтогОсталосьИзготовить;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры


#КонецОбласти

#Область Отчеты

&НаКлиенте
Процедура ОтчетВыполнениеЗаказов(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачальнаяДата",НачальнаяДата);
	ПараметрыОтчета.Вставить("КонечнаяДата", КонечнаяДата);
	ОткрытьФорму("Отчет.ВыполнениеЗаказов.Форма.ФормаОтчета",ПараметрыОтчета,ЭтаФорма);
КонецПроцедуры	


#КонецОбласти

#Область Пересчеты

&НаКлиенте
Процедура Обновить(Команда)
	ЭлементыДерева = ПроизводствоЗаказов.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	ЗаполнитьПроизводствоЗаказовНаСервере();
КонецПроцедуры


#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ЗаполнитьПроизведенныеЗаказы(Команда)
   Реализация.Очистить();
   Для каждого СтрПроизводствоЗаказов Из ПроизводствоЗаказов.ПолучитьЭлементы() Цикл
       Если СтрПроизводствоЗаказов.ОсталосьИзготовить = 0 Тогда
	       СтрРеализация 							  = Реализация.Добавить();
		   СтрРеализация.ЗаказКлиента 				  = СтрПроизводствоЗаказов.ЗаказКлиента;
		   СтрРеализация.Клиент 			  = ПолучитьКлиентаНаСервере(СтрРеализация.ЗаказКлиента);
	   КонецЕсли;
   КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиентаНаСервере(ЗаказКлиента)
    Возврат ЗаказКлиента.Клиент;
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Стр Из Реализация Цикл
       Стр.Выбор = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого Стр Из Реализация Цикл
       Стр.Выбор = Ложь;
	КонецЦикла	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРеализации(Команда)
	Если НЕ Реализация.Количество() = 0 Тогда
	   Для каждого СтрРеализация Из Реализация Цикл
		   если СтрРеализация.Выбор = Истина тогда
			   ЗаказанныеИзделия.Очистить();
			   ЗаполнитьЗаказанныеИзделияНаСервере(СтрРеализация.ЗаказКлиента);
			   
			   ФормаРеализация = ОткрытьФорму("Документ.Реализация.Форма.ФормаДокумента",,,Новый УникальныйИдентификатор);
			   ФормаРеализация.Объект.Дата = ТекущаяДата();
			   ФормаРеализация.Объект.Клиент = СтрРеализация.Клиент;
			   ФормаРеализация.Объект.ЗаказКлиента = СтрРеализация.ЗаказКлиента;			   
			   
			   Для каждого СтрИзделия Из ЗаказанныеИзделия Цикл
			       СтрФормаРеализацияЗаказанныеИзделия = ФормаРеализация.Объект.ЗаказанныеИзделия.Добавить();
				   СтрФормаРеализацияЗаказанныеИзделия.Изделие = СтрИзделия.Изделие;
				   СтрФормаРеализацияЗаказанныеИзделия.Спецификация = СтрИзделия.Спецификация;
				   СтрФормаРеализацияЗаказанныеИзделия.Количество = СтрИзделия.Количество;
				   СтрФормаРеализацияЗаказанныеИзделия.Цена =СтрИзделия.Цена;
				   СтрФормаРеализацияЗаказанныеИзделия.Сумма = СтрИзделия.Сумма;
			   КонецЦикла;
		   конецесли;
	   КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьЗаказанныеИзделияНаСервере(ЗаказКлиента)
	Для каждого СтрЗаказанныеИзделия Из ЗаказКлиента.ЗаказанныеИзделия Цикл
	    СтрТЗЗаказанныеИзделия = ЗаказанныеИзделия.Добавить();
		СтрТЗЗаказанныеИзделия.Изделие = СтрЗаказанныеИзделия.Изделие;
		СтрТЗЗаказанныеИзделия.Спецификация = СтрЗаказанныеИзделия.Спецификация;
		СтрТЗЗаказанныеИзделия.Количество = СтрЗаказанныеИзделия.Количество;
		СтрТЗЗаказанныеИзделия.Цена = СтрЗаказанныеИзделия.Цена;
		СтрТЗЗаказанныеИзделия.Сумма = СтрЗаказанныеИзделия.Сумма; 
	КонецЦикла;
КонецПроцедуры


#КонецОбласти
